# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.
msg1 = input()
msg2 = input()

print(msg1.count(msg2))